# Использование образа Go с Alpine для компиляции
FROM golang:1.23-alpine as builder

# Установка рабочей директории в контейнере
WORKDIR /app

# Копирование всех файлов из локальной папки backend в папку /app/backend в контейнере
COPY backend/ ./backend

# Переход в папку с исходным кодом где находится main.go и другие необходимые файлы
WORKDIR /app/backend/cmd

# Загрузка зависимостей
RUN go mod download

# Сборка приложения
RUN go build -o myapp .

# Использование лёгкого базового образа для запуска
FROM alpine:latest

# Установка рабочей директории в контейнере
WORKDIR /root/

# Копирование скомпилированного файла из предыдущего шага в рабочую директорию
COPY --from=builder /app/backend/cmd/myapp .

# Указание, что контейнер будет слушать на порту 8080
EXPOSE 8080

# Команда для запуска приложения
CMD ["./myapp"]

